{
	"None": {
		"0": [
			"Serafina",
			0,
			"Debug scenario."
		]
	},
	"ChallengeSera": {
		"0": [
			"Serafina",
			0,
			"I can't believe it... I've completed my maid training!"
		],
		"1": [
			"Serafina",
			2,
			"It seems like only yesterday I was a tiny fledgling maid learning from Lady Felicia... I can still hear her reprimands..."	
		],
		"2": [
			"Serafina",
			1,
			"Hmm, it doesn't seem like anyone else will need to be served today. Perhaps I should go over everything before my first assignment..."
		],
		"3": [
			"Onboarding",
			0,
			"Welcome to Maid Rush Madness! The goal of the game is to serve dishes to your increasingly demanding guests."
		],
		"4": [
			"Onboarding",
			1,
			"Ingredients for recipes will fall out of the sky. You need to move Serafina under them to catch them!"
		], 		
		"5": [
			"Onboarding",
			2,
			"You can move Serafina left and right using the arrow keys."
		],
		"6": [
			"Onboarding",
			3,
			"You'll catch an ingredient when it falls and collides with Serafina! Your currently held ingredients can be seen on her plate."
		],
		"7": [
			"Onboarding",
			4,
			"Catch 3 ingredients to make a dish! There are a lot of combinations that lead to certain dishes, and some don't lead to any dishes at all..."
		],
		"8": [
			"Onboarding",
			5,
			"When you have created a dish, it'll show up on your plate! You can't catch any more ingredients until you serve your currently held dish."
		],
		"9": [
			"Onboarding",
			6,
			"To serve your current dish, press the spacebar!"
		],
		"10": [
			"Onboarding",
			6,
			"(Tip: If your plate only has ingredients and you haven't made a dish yet, you can press space to clear your plate!)"
		],
		"11": [
			"Onboarding",
			7,
			"You need to serve dishes before time runs out! The timer at the bottom of the screen will tell you how much time you have left."
		],
		"12": [
			"Onboarding",
			8,
			"The timer will progressively fill as you play the game. Some guests are needier than others, meaning the timer will fill faster!"
		],
		"13": [
			"Onboarding",
			9,
			"If the timer fills and you haven't yet completed the order, the current request will reappear to remind you of what to make!"
		],
		"14": [
			"Onboarding",
			9,
			"Serafina might also get a little discouraged... if she messes up too many times, she'll fail her assignment!"
		],
		"15": [
			"Onboarding",
			0,
			"Each guest will have different dishes they'd like to be served. Make sure to remember which one to make before the request window disappears!"
		],
		"16": [
			"Onboarding",
			0,
			"That's all for the tutorial, good luck!"
		]
	},
	"ChallengeLetti": {
		"0": [
			"Letti",
			0,
			"Oh my... that journey sure was something. I'm starving."
		],
		"1": [
			"Letti",
			0,
			"It smells amazing in here... I hope I'll have enough room for dessert!"
		],
		"2": [
			"Letti",
			1,
			"Hello there! Are you the maid who will be serving to me? It's a pleasure to meet you! I'm Letti."
		],
		"3": [
			"Letti",
			0,
			"I've heard you just completed your training. I'm excited to see what your mentor has taught you!"
		],
		"4": [
			"Letti",
			0,
			"You wouldn't happen to make anything sweet? Like maybe a cake, or perhaps a sundae..."
		],
		"5": [
			"Letti",
			1,
			"Ah, but of course I would love to sample your meals as well!"
		],
		"6": [
			"Serafina",
			4,
			"(O-oh my! Doesn't she work at that famed aquatic lab by the southern ocean..?)"
		],
		"7": [
			"Serafina",
			1,
			"(Things that are sweet...perhaps I should focus on providing desserts.)"
		],
		"8": [
			"Letti",
			0,
			"Please take your time serving me! I want to try your very best dishes!"
		]
	},
	"ChallengeAnnieAlex": {
		"0": [
			"Serafina",
			4,
			"This lake is lovely! My clients must be around here somewhere..."
		],
		"1": ["Serafina",
			1,
			"Serving two clients once is awfully unusual. And they booked me so late! This better have been worth it."
		],
		"2": ["AnnieAlex",
			0,
			"Hey, over here!"
		],
		"3": ["AnnieAlex",
			0,
			"Thanks for coming out. Name's Annie, and this is my brother Alex! Say hi, Alex!"
		],
		"4": ["AnnieAlex",
			0,
			"...Hello."
		],
		"5": ["AnnieAlex",
			0,
			"We're out here on vacation. Figured we might as well see the sights before we hit the road again, y'know?"
		],
		"6": ["AnnieAlex",
			0,
			"We really appreciate you taking our request so last minute. Wouldn't be a vacation without some good eats, right, Alex?"
		],
		"7": ["AnnieAlex",
			0,
			"...I suppose."
		],
		"8": ["AnnieAlex",
		0,
		"Perhaps a few savory meals would improve our time here. I admit I am intrigued by the services you advertised."
		],
		"9": ["AnnieAlex",
		0,
		"It was Annie who requested you. Please do not make me regret her decision."
		],
		"10": ["AnnieAlex",
		0,
		"Oh, don't mind him! He's just cranky from not eating all day. I'm sure you'll do great!"
		],
		"11": ["Serafina",
		3,
		"(Who on earth are these people?! Are they just two young no-name wizards..?)"
		],
		"12": ["Serafina",
		1,
		"(Nevertheless, they were able to pay my late fee. Perhaps they're celebrities from some far-off land.)"
		],
		"13": ["Serafina",
		0,
		"(If I do well, maybe they can advertise my services in places I've never been!)"
		]
	},
	"ChallengeGob": {
		"0": [
			"Serafina",
			0,
			"Home sweet home! And not too late today either. I suppose I should tidy up a bit before bed."
		],
		"1": [
			"Serafina",
			2,
			"*CRASH*"
		],
		"2": [
			"Serafina",
			2,
			"..?"
		],
		"3": [
			"Gob",
			0,
			"Hello."
		],
		"4": [
			"Serafina",
			3,
			"E-EEK!!!!!"
		],
		"5": [
			"Gob",
			0,
			"Oh, sorry about that. I guess I'm a bit late, aren't I? Name's Gob, I think I reserved your manor for dinner a few hours ago?"
		],
		"6": [
			"Gob",
			0,
			"I would have come earlier but I got held up at work. I'm sure you know how that feels!"
		],
		"7": [
			"Gob",
			0,
			"...I guess you'll be getting held up right now. Sorry about that."
		],
		"8": [
			"Gob",
			0,
			"You got anything sweet? Or filling maybe? I haven't had time to eat all day. I'm starving!"
		],
		"9": [
			"Gob",
			0,
			"Hey, and uh, take your time making the food and all that, but I'm sure we'd both like to try to turn in as soon as we can."
		],
		"10": [
			"Serafina",
			2,
			"(And here I thought I'd get to go to bed early!)"
		],
		"11": [
			"Serafina",
			1,
			"(Although, from what I remember from his reservation, he works for a fairly well-known curse manfacturer... I don't want to get on his bad side...)"
		]
	},
	"ChallengeDoll": {
		"0": [
			"Serafina",
			2,
			"(The sun has barely risen... who on earth reserved me this early?)"
		],
		"1": [
			"Doll",
			0,
			"..."
		],
		"2": [
			"Doll",
			0,
			"Hello."
		],
		"3": [
			"Doll",
			0,
			"I have heard good things about your services."
		],
		"4": [
			"Doll",
			0,
			"Savory dishes, sweet meals..."
		],
		"5": [
			"Doll",
			0,
			"Even your more...unconventional creations."
		],
		"6": [
			"Doll",
			0,
			"I want to taste it all."
		],
		"7": [
			"Doll",
			0,
			"I want to see what it is like to be...human."
		],
		"8": [
			"Doll",
			0,
			"I expect prompt and perfect service. Do not disappoint me."
		],
		"9": [
			"Serafina",
			3,
			"(Eek!)"
		],
		"10": [
			"Serafina",
			3,
			"(That's one of Lady Lacrimosa's artificial handmaidens!)"
		],
		"11": [
			"Serafina",
			2,
			"(I must be on my best behavior, lest I draw the lady's wrath...)"
		]
	},
	"ChallengeEnd": {
		"0": [
			"Serafina",
			0,
			"My first week as a maid has been a huge success!"
		],
		"1": [
			"Serafina",
			0,
			"I'm getting reservation requests left and right, I'll have to start being more selective..."
		],
		"2": [
			"Serafina",
			1,
			"Hmmm, I wonder who I should serve next..?"
		],
		"3": [
			"None",
			0,
			"Thank you for playing Maid Rush Madness!"
		],
		"4": [
			"None",
			0,
			"You can replay any of the challenges from the main menu, and even try out endless mode!"
		],
		"5": [
			"None",
			0,
			"See you soon!"
		]
	}
}
